; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v3)
             (pred_12 ?v1 ?v10)
             (pred_4 ?v6 ?v10)
             (pred_10 ?v4 ?v6 )
	     (pred_9 ?v6)
             (pred_5 ?v2)
             (pred_2 ?v1)
             (pred_11 ?v10)
             (pred_8 ?v6)
             (pred_3 ?v1)
             (pred_6 ?v6)
             (pred_1 ))



(:action op_1
:parameters (?v12 ?v5 ?v8 ?v9)
:precondition (and (pred_5 ?v12) (pred_5 ?v5) (pred_2 ?v8) (pred_11 ?v9)
          (pred_7 ?v12 ?v5) (pred_12 ?v8 ?v9)
                   (pred_4 ?v5 ?v9) (pred_9 ?v12) 
                   (pred_8 ?v5) (pred_3 ?v8))
:effect (and  (pred_6 ?v5) (not (pred_8 ?v5))))


(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_5 ?v12) (pred_5 ?v11)
               (pred_9 ?v12) (pred_7 ?v12 ?v11) (pred_6 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v8)
:precondition (and (pred_5 ?v12) (pred_2 ?v8) 
                  (pred_9 ?v12) (pred_10 ?v8 ?v12) (pred_1 ))
:effect (and (pred_3 ?v8)
   (not (pred_10 ?v8 ?v12)) (not (pred_1 ))))


(:action op_4
:parameters (?v12 ?v13 ?v7)
:precondition (and (pred_5 ?v12) (pred_2 ?v13) (pred_2 ?v7)
                  (pred_9 ?v12) (pred_3 ?v7) (pred_10 ?v13 ?v12))
:effect (and (pred_3 ?v13) (pred_10 ?v7 ?v12)
        (not (pred_3 ?v7)) (not (pred_10 ?v13 ?v12))))

(:action op_3
:parameters (?v12 ?v8)
:precondition (and (pred_5 ?v12) (pred_2 ?v8) 
                  (pred_9 ?v12) (pred_3 ?v8))
:effect (and (pred_1 ) (pred_10 ?v8 ?v12) (not (pred_3 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_16 obj_05 obj_04 obj_14 obj_08 obj_11 obj_20 obj_15 obj_19 obj_09 obj_18 obj_01 obj_07 obj_03 obj_10
    obj_12 obj_13
    obj_02 obj_21 obj_17
    )

    (:init
       (pred_1)

       (pred_5 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_04)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_21)
       (pred_2 obj_17)

       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_08 obj_19)
       (pred_7 obj_08 obj_11)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_08)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_08)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_18 obj_10)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_10 obj_18)
       (pred_7 obj_10 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_4  obj_08 obj_12)
       (pred_4  obj_10 obj_13)
       (pred_4  obj_01 obj_13)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_15)
       (pred_6 obj_19)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_07)
       (pred_6 obj_03)

       (pred_12  obj_02 obj_12)
       (pred_12  obj_21 obj_13)
       (pred_12  obj_17 obj_13)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_17 obj_03)
       (pred_9 obj_14)
    )

    (:goal (and
       (pred_10 obj_02 obj_15)
       (pred_10 obj_21 obj_15)
       (pred_10 obj_17 obj_20)
    ))
(:constraints
  (always (not (pred_9 obj_09)))
)
)

; plan
1. (op_2 obj_14 obj_15)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_15)
   goals met: 0 of 3
2. (op_2 obj_15 obj_19)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_19)
   goals met: 0 of 3
3. (op_5 obj_19 obj_21)
   deleted: (pred_10 obj_21 obj_19) (pred_1)
   added: (pred_3 obj_21)
   goals met: 0 of 3
4. (op_2 obj_19 obj_15)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_15)
   goals met: 0 of 3
5. (op_3 obj_15 obj_21)
   deleted: (pred_3 obj_21)
   added: (pred_1) (pred_10 obj_21 obj_15)
   goals met: 1 of 3
6. (op_2 obj_15 obj_19)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_19)
   goals met: 1 of 3
7. (op_5 obj_19 obj_02)
   deleted: (pred_10 obj_02 obj_19) (pred_1)
   added: (pred_3 obj_02)
   goals met: 1 of 3
8. (op_2 obj_19 obj_15)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_15)
   goals met: 1 of 3
9. (op_3 obj_15 obj_02)
   deleted: (pred_3 obj_02)
   added: (pred_1) (pred_10 obj_02 obj_15)
   goals met: 2 of 3
10. (op_2 obj_15 obj_19)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_19)
   goals met: 2 of 3
11. (op_2 obj_19 obj_07)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_07)
   goals met: 2 of 3
12. (op_2 obj_07 obj_03)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_03)
   goals met: 2 of 3
13. (op_5 obj_03 obj_17)
   deleted: (pred_10 obj_17 obj_03) (pred_1)
   added: (pred_3 obj_17)
   goals met: 2 of 3
14. (op_1 obj_03 obj_10 obj_17 obj_13)
   deleted: (pred_8 obj_10)
   added: (pred_6 obj_10)
   goals met: 2 of 3
15. (op_2 obj_03 obj_10)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_10)
   goals met: 2 of 3
16. (op_2 obj_10 obj_18)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_18)
   goals met: 2 of 3
17. (op_2 obj_18 obj_20)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_20)
   goals met: 2 of 3
18. (op_3 obj_20 obj_17)
   deleted: (pred_3 obj_17)
   added: (pred_1) (pred_10 obj_17 obj_20)
   goals met: 3 of 3
